netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/api_search_negative.xml


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:messages_2014_1.platform.webservices.netsuite.com" xmlns:urn1="urn:core_2014_1.platform.webservices.netsuite.com">
   <soapenv:Header>
      <urn:searchPreferences>
         <urn:bodyFieldsOnly></urn:bodyFieldsOnly>
         <urn:returnSearchColumns></urn:returnSearchColumns>
         <urn:pageSize></urn:pageSize>
      </urn:searchPreferences>
      <urn:partnerInfo>
         <urn:partnerId></urn:partnerId>
      </urn:partnerInfo>
      <urn:applicationInfo>
         <urn:applicationId></urn:applicationId>
      </urn:applicationInfo>
      <urn:passport>
         <urn1:email>%s(email)</urn1:email>
         <urn1:password>%s(password)</urn1:password>
         <urn1:account>%s(account)</urn1:account>
      </urn:passport>
   </soapenv:Header>
   <soapenv:Body>
      <urn:search>
      <urn:searchRecord  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xsi:type="ns1:EmployeeSearch" xmlns:ns1="urn:employees_2014_1.lists.webservices.netsuite.com" xmlns:platformMsgs="urn:messages_2014_1.platform.webservices.netsuite.com" xmlns:platformCore="urn:core_2014_1.platform.webservices.netsuite.com">
      <basic>
        <email operator="contains" xsi:type="platformCore:SearchStringField1">
            <searchValue>.com</searchValue>
            </email>
        </basic>
        </urn:searchRecord>
      </urn:search>
   </soapenv:Body>
</soapenv:Envelope>
